/******************************************************************************/
/*                        -- 深圳安信可科技有限公司 --                        */
/*
//  文件名：                                                              
//  说明：                                                                  
//  编写人员：                                                                   
//  编写日期：                                                              
//  程序维护：
//  维护记录：
//
//                                                          
*/ 
// 免责声明：该程序仅用于学习与交流 
// (c) Anxinke Corporation. All rights reserved.                                                               
/******************************************************************************/
#include<intrins.h>
#include "delay.h"



/******************************************************************************/
// 函数名称： 
// 输入参数： 
// 输出参数： 
// 函数功能： 
/******************************************************************************/

void Delay2ms()		//@22.1184MHz
{
	unsigned char i, j;

	_nop_();
	i = 44;
	j = 4;
	do
	{
		while (--j);
	} while (--i);
}

void Delay20us()		//@22.1184MHz
{
	unsigned char i;

	i = 108;
	while (--i);
}
void Delay5000us()		//@22.1184MHz
{
	unsigned char i, j;

	i = 108;
	j = 145;
	do
	{
		while (--j);
	} while (--i);
}

void Delay200ms()		//@22.1184MHz
{
	unsigned char i, j, k;

	_nop_();
	_nop_();
	i = 17;
	j = 208;
	k = 27;
	do
	{
		do
		{
			while (--k);
		} while (--j);
	} while (--i);
}
/*
void Delay100ms(void)       //@22.1184MHz
{
	unsigned char i, j, k;
	_nop_();
	_nop_();
	i = 9;
	j = 104;
	k = 139;
	do
	{
		do
		{
			while (--k);
		} while (--j);
	} while (--i);
}  */

/******************************************************************************/
// 函数名称： 
// 输入参数： 
// 输出参数： 
// 函数功能： 
/******************************************************************************/
void Delay10us()		//@22.1184MHz
{
	unsigned char i;

	_nop_();
	_nop_();
	_nop_();
	i = 52;
	while (--i);
}

void Delay1ms()		//@22.1184MHz
{
	unsigned char i, j;

	_nop_();
	_nop_();
	i = 22;
	j = 128;
	do
	{
		while (--j);
	} while (--i);
}

